public class Main {
    public static void main(String[] args){
        //Задание №1.
        int clientOS = 1;
        System.out.println("Задание 1");
        if (clientOS == 1) {
            System.out.println("Установите версию приложения для Android по ссылке");
        } else if (clientOS == 0) {
            System.out.println("Установите версию приложения для IOS по ссылке");
        } else {
            System.out.println("Мы не знаем что это за операционная система");
        }

        //Задание №2.

    }
}
